/**
 * // 给定一个整数，输出Mausoleum 数组
// Mausoleum数组：由1,1,2,2,3,3,…,n-1,n-1,n,n 构成
// 首先是不减少(即 增加或保持不变)，然后是不增加()减少或保持不变)

// Mausoleum数组示例
// [1, 2, 2, 3, 4, 4, 3, 1]; 
// [1, 1]; 
// [2, 2, 1, 1]; 
// [1, 2, 3, 3, 2, 1]. 
// input

// 输入输出示例
// n=1, [1,1]
// n=2, [1,1,2,2],[1,2,2,1],[2,2,1,1] 
// n = 3,[3, 3, 2, 2, 1, 1],[2, 3, 3, 2, 1, 1],[2, 2, 3, 3, 1, 1],[1, 3, 3, 2, 2, 1],
[1, 2, 3, 3, 2, 1],[1, 2, 2, 3, 3, 1],
[1, 1, 3, 3, 2, 2],[1, 1, 2, 3, 3, 2],[1, 1, 2, 2, 3, 3]
 */

const mausoleum = (num) => {
  let arr = [], results = [], result = [];
  for (let i = 0; i < num; i++) {
    arr.push(...[num - i, num - i]);
  }
  // TODO
};

console.log(mausoleum(3));
console.log(mausoleum(4));
